The  FilteredWorksetCollector  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  FilteredWorksetCollector Class
  Autodesk.Revit.DB Namespace